app/controllers/user_controller.rb

  def login
    if request.post?
    	user = User.where(:username => params[:username]).first
---
SELECT  `users`.* FROM `users`  WHERE `users`.`username` = 'kajane'  ORDER BY `users`.`id` ASC LIMIT 1